nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1010/demo_apps/sai/pin_mux.h
/*
 * Copyright 2019-2020 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_09 (number 3), LPUART1_RXD */
/* Routed pin properties */
#define BOARD_LPUART1_RXD_PERIPHERAL                                     LPUART1   /*!< Peripheral name */
#define BOARD_LPUART1_RXD_SIGNAL                                             RXD   /*!< Signal name */

/* GPIO_10 (number 2), LPUART1_XD */
/* Routed pin properties */
#define BOARD_LPUART1_TXD_PERIPHERAL                                     LPUART1   /*!< Peripheral name */
#define BOARD_LPUART1_TXD_SIGNAL                                             TXD   /*!< Signal name */

/* GPIO_08 (number 4), SAI1_MCLK */
/* Routed pin properties */
#define BOARD_SAI1_MCLK_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_SAI1_MCLK_SIGNAL                                          sai_mclk   /*!< Signal name */

/* GPIO_06 (number 6), SAI1_TX_BCLK */
/* Routed pin properties */
#define BOARD_SAI1_TX_BCLK_PERIPHERAL                                       SAI1   /*!< Peripheral name */
#define BOARD_SAI1_TX_BCLK_SIGNAL                                    sai_tx_bclk   /*!< Signal name */

/* GPIO_07 (number 5), SAI1_TX_SYNC */
/* Routed pin properties */
#define BOARD_SAI1_TX_SYNC_PERIPHERAL                                       SAI1   /*!< Peripheral name */
#define BOARD_SAI1_TX_SYNC_SIGNAL                                    sai_tx_sync   /*!< Signal name */

/* GPIO_04 (number 9), SAI1_TXD0 */
/* Routed pin properties */
#define BOARD_SAI1_TXD0_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_SAI1_TXD0_SIGNAL                                      sai_tx_data0   /*!< Signal name */

/* GPIO_03 (number 10), SAI1_RXD0 */
/* Routed pin properties */
#define BOARD_SAI1_RXD0_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_SAI1_RXD0_SIGNAL                                      sai_rx_data0   /*!< Signal name */

/* GPIO_02 (number 11), I2C1_SCL */
/* Routed pin properties */
#define BOARD_I2C1_SCL_PERIPHERAL                                         LPI2C1   /*!< Peripheral name */
#define BOARD_I2C1_SCL_SIGNAL                                                SCL   /*!< Signal name */

/* GPIO_01 (number 12), I2C1_SDA */
/* Routed pin properties */
#define BOARD_I2C1_SDA_PERIPHERAL                                         LPI2C1   /*!< Peripheral name */
#define BOARD_I2C1_SDA_SIGNAL                                                SDA   /*!< Signal name */

/* GPIO_AD_09 (number 48), ADC12_4/JTAG_TDO/J55[6]/J26[4] */
/* Routed pin properties */
#define BOARD_ADC12_4_PERIPHERAL                                             ARM   /*!< Peripheral name */
#define BOARD_ADC12_4_SIGNAL                                       arm_trace_swo   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
